<a href="https://colab.research.google.com/github/bryanzheng2222/SF-Salary-Dataset/blob/main/SF_Salaries_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:

import pandas as pd
import os

In [ ]:
from google.colab import drive
drive.mount('/content/drive/')

Drive already mounted at /content/drive/; to attempt to forcibly remount, call drive.mount("/content/drive/", force_remount=True).

In [ ]:
base_dir = './drive/MyDrive/Colab Notebooks/SF_Salaries_Dataset'

In [ ]:
Sal = pd.read_csv(os.path.join(base_dir, "Salaries.csv"))

/usr/local/lib/python3.7/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [ ]:
Sal.head(2)

   Id    EmployeeName  ...         Agency Status
0   1  NATHANIEL FORD  ...  San Francisco    NaN
1   2    GARY JIMENEZ  ...  San Francisco    NaN

[2 rows x 13 columns]

In [ ]:
Sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

In [ ]:
Sal['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [ ]:
Sal[Sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [ ]:
Sal[Sal['EmployeeName'] == 'JOSEPH DRISCOLL']

    Id     EmployeeName                   JobTitle  ... Notes         Agency Status
24  25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  ...   NaN  San Francisco    NaN

[1 rows x 13 columns]

In [ ]:
Sal[Sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [ ]:
Sal[Sal['TotalPayBenefits'] == Sal['TotalPayBenefits'].max()]

   Id    EmployeeName  ...         Agency Status
0   1  NATHANIEL FORD  ...  San Francisco    NaN

[1 rows x 13 columns]

In [ ]:
Sal['TotalPayBenefits'].idxmax()

0

In [ ]:
Sal['TotalPayBenefits'].argmin()

148653

In [ ]:
Sal.iloc[Sal['TotalPayBenefits'].argmin()]

Id                                      148654
EmployeeName                         Joe Lopez
JobTitle            Counselor, Log Cabin Ranch
BasePay                                   0.00
OvertimePay                               0.00
OtherPay                               -618.13
Benefits                                  0.00
TotalPay                               -618.13
TotalPayBenefits                       -618.13
Year                                      2014
Notes                                      NaN
Agency                           San Francisco
Status                                      PT
Name: 148653, dtype: object

In [ ]:
Sal.groupby('Year').mean()

            Id      TotalPay  TotalPayBenefits  Notes
Year
2011   18080.0  71744.103871      71744.103871    NaN
2012   54542.5  74113.262265     100553.229232    NaN
2013   91728.5  77611.443142     101440.519714    NaN
2014  129593.0  75463.918140     100250.918884    NaN

In [ ]:
Sal.groupby('Year').mean()['TotalPayBenefits']

Year
2011     71744.103871
2012    100553.229232
2013    101440.519714
2014    100250.918884
Name: TotalPayBenefits, dtype: float64

In [ ]:
Sal['TotalPayBenefits'].mean()

93692.55481056834

In [ ]:
Sal['TotalPayBenefits'].max()

567595.43

In [ ]:
Sal['JobTitle'].nunique()

2159

In [ ]:
Sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [ ]:
Sal[Sal['Year']==2013]['JobTitle'].value_counts() == 1

Transit Operator                False
Special Nurse                   False
Registered Nurse                False
Public Svc Aide-Public Works    False
Custodian                       False
                                ...
Laboratory Technician I          True
Acupuncturist                    True
Mgr Museum Security Services     True
Animal Care Asst Supv            True
Wire Rope Cable Maint Sprv       True
Name: JobTitle, Length: 1051, dtype: bool

In [ ]:
sum(Sal[Sal['Year']==2013]['JobTitle'].value_counts() == 1)

202

In [ ]:
Sal['JobTitle']

0         GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                        CAPTAIN III (POLICE DEPARTMENT)
2                        CAPTAIN III (POLICE DEPARTMENT)
3                   WIRE ROPE CABLE MAINTENANCE MECHANIC
4           DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
                               ...
148649                                         Custodian
148650                                      Not provided
148651                                      Not provided
148652                                      Not provided
148653                        Counselor, Log Cabin Ranch
Name: JobTitle, Length: 148654, dtype: object

In [ ]:
def chief_string(title):
  if 'chief' in title.lower().split():
    return True
  else:
    return False

In [ ]:
chief_string('CHIEF MANAGER - METROPOLITAN TRANSIT AUTHORITY')

True

In [ ]:
sum(Sal['JobTitle'].apply(lambda x: chief_string(x)))

477

In [ ]:
Sal['title_len'] = Sal['JobTitle'].apply(len)

In [ ]:
Sal[['TotalPayBenefits','title_len']].corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000